<?php
    $referrer = (isset($_SERVER['HTTP_REFERER']))? $_SERVER['HTTP_REFERER']: '';
    if ($referrer) {
        $host = (isset($_SERVER['SERVER_NAME']))? $_SERVER['SERVER_NAME']: (isset($_SERVER['HTTP_HOST']))? $_SERVER['HTTP_HOST']: '';
        if (preg_match("~^(http|https)://$host.*$~", $referrer)) {
            $allow = true;
        } else {
            $allow = false;
        }
    } else {
        $allow = false;
    }
    if ($allow) {
        $url = (isset($_GET['url']) && !empty($_GET['url']))? rawurldecode($_GET['url']): '';
        $crl = curl_init();
        curl_setopt($crl, CURLOPT_URL, $url);
        curl_setopt($crl, CURLOPT_FOLLOWLOCATION, 1);
        curl_setopt($crl, CURLOPT_RETURNTRANSFER, 1);
        curl_setopt($crl, CURLOPT_SSL_VERIFYPEER, 0);
        curl_setopt($crl, CURLOPT_SSL_VERIFYHOST, 0);
        $json = curl_exec($crl);
        $code = curl_getinfo($crl, CURLINFO_HTTP_CODE);
        if ($code === 200) {
            $data = array('data' => json_decode($json, true));
        } else {
            $info = curl_getinfo($crl);
            $data = array('error' => $info);
        }
    } else {
        $data = array('error' => 'not allow');
    }
    echo json_encode($data);
    //echo '{"data": [{"y2011":5.4,"y2010":5.7,"nameKaz":"Қостанай облысы","y2002":9.3,"y2001":10.3,"y2004":8.5,"y2003":8.7,"y2006":7.8,"y2014":5,"y2005":8.2,"y2013":5.2,"y2008":6.9,"y2012":5.2,"y2007":7.5,"nameRu":"КОСТАНАЙСКАЯ ОБЛАСТЬ","measureKaz":"Пайыз","y2009":6.3,"measureRu":"Процент"},{"y2011":5.7,"y2010":5.9,"nameKaz":"Оңтүстік Қазақстан облысы","y2002":9.4,"y2001":11.5,"y2004":7.8,"y2003":8.6,"y2006":7.2,"y2014":5.4,"y2005":7.5,"y2013":5.5,"y2008":6.6,"y2012":5.6,"y2007":6.9,"nameRu":"ЮЖНО-КАЗАХСТАНСКАЯ ОБЛАСТЬ","measureKaz":"Пайыз","y2009":6.6,"measureRu":"Процент"},{"y2011":5.4,"y2010":5.8,"nameKaz":"Солтүстік Қазақстан облысы","y2002":8,"y2001":8.9,"y2004":8.1,"y2003":8,"y2006":7.2,"y2014":5,"y2005":7.9,"y2013":5.1,"y2008":6.3,"y2012":5.2,"y2007":6.9,"nameRu":"СЕВЕРО-КАЗАХСТАНСКАЯ ОБЛАСТЬ","measureKaz":"Пайыз","y2009":6.3,"measureRu":"Процент"},{"y2011":5.8,"y2010":6.4,"nameKaz":"Маңғыстау облысы","y2002":9.8,"y2001":10.5,"y2004":9.8,"y2003":9.7,"y2006":9.3,"y2014":5,"y2005":9.7,"y2013":5.5,"y2008":6.9,"y2012":5.7,"y2007":8.5,"nameRu":"МАНГИСТАУСКАЯ ОБЛАСТЬ","measureKaz":"Пайыз","y2009":7.1,"measureRu":"Процент"},{"y2011":5.8,"y2010":6.2,"nameKaz":"Астана қ.","y2002":8.7,"y2001":9.3,"y2004":8.3,"y2003":8.4,"y2006":8,"y2014":5.1,"y2005":8.2,"y2013":5.5,"y2008":6.6,"y2012":5.7,"y2007":7.6,"nameRu":"Г.АСТАНА","measureKaz":"Пайыз","y2009":6.6,"measureRu":"Процент"},{"y2011":4.9,"y2010":5.3,"nameKaz":"Ақтөбе облысы","y2002":10.2,"y2001":11.4,"y2004":9.4,"y2003":9.7,"y2006":8.5,"y2014":4.9,"y2005":9.2,"y2013":4.9,"y2008":6.4,"y2012":5,"y2007":7.4,"nameRu":"АКТЮБИНСКАЯ ОБЛАСТЬ","measureKaz":"Пайыз","y2009":6,"measureRu":"Процент"},{"y2011":5.5,"y2010":5.7,"nameKaz":"Жамбыл облысы","y2002":12.3,"y2001":12.7,"y2004":10.2,"y2003":11.1,"y2006":9.2,"y2014":4.9,"y2005":9.8,"y2013":5.2,"y2008":6.5,"y2012":5.4,"y2007":7.7,"nameRu":"ЖАМБЫЛСКАЯ ОБЛАСТЬ","measureKaz":"Пайыз","y2009":6.5,"measureRu":"Процент"},{"y2011":5.5,"y2010":5.9,"nameKaz":"Қызылорда облысы","y2002":12.5,"y2001":13.9,"y2004":10.2,"y2003":11.4,"y2006":9.3,"y2014":5,"y2005":9.7,"y2013":5.2,"y2008":6.9,"y2012":5.3,"y2007":8.2,"nameRu":"КЫЗЫЛОРДИНСКАЯ ОБЛАСТЬ","measureKaz":"Пайыз","y2009":6.6,"measureRu":"Процент"},{"y2011":5.2,"y2010":5.7,"nameKaz":"Шығыс Қазақстан облысы","y2002":7.3,"y2001":7.3,"y2004":7.2,"y2003":7.3,"y2006":6.9,"y2014":4.8,"y2005":7.1,"y2013":5.1,"y2008":6.4,"y2012":5.1,"y2007":6.6,"nameRu":"ВОСТОЧНО-КАЗАХСТАНСКАЯ ОБЛАСТЬ","measureKaz":"Пайыз","y2009":6.4,"measureRu":"Процент"},{"y2011":5.5,"y2010":5.8,"nameKaz":"Ақмола облысы","y2002":9.2,"y2001":10.8,"y2004":9.2,"y2003":9.2,"y2006":8.6,"y2014":4.9,"y2005":8.9,"y2013":5.2,"y2008":7.1,"y2012":5.3,"y2007":8,"nameRu":"АКМОЛИНСКАЯ ОБЛАСТЬ","measureKaz":"Пайыз","y2009":6.9,"measureRu":"Процент"},{"y2011":5.1,"y2010":5.6,"nameKaz":"Алматы облысы","y2002":9.2,"y2001":10.2,"y2004":7.8,"y2003":8.6,"y2006":7.1,"y2014":4.9,"y2005":7.3,"y2013":4.9,"y2008":6.4,"y2012":5,"y2007":6.7,"nameRu":"АЛМАТИНСКАЯ ОБЛАСТЬ","measureKaz":"Пайыз","y2009":6.5,"measureRu":"Процент"},{"y2011":5.3,"y2010":5.5,"nameKaz":"Қарағанды облысы","y2002":8.3,"y2001":9.2,"y2004":7.4,"y2003":7.5,"y2006":6.9,"y2014":4.9,"y2005":7,"y2013":5,"y2008":6.2,"y2012":5.1,"y2007":6.7,"nameRu":"КАРАГАНДИНСКАЯ ОБЛАСТЬ","measureKaz":"Пайыз","y2009":6.1,"measureRu":"Процент"},{"y2011":5.2,"y2010":5.6,"nameKaz":"Павлодар облысы","y2002":8.7,"y2001":9.2,"y2004":7.7,"y2003":8.2,"y2006":7.4,"y2014":4.8,"y2005":7.6,"y2013":5,"y2008":6.4,"y2012":4.9,"y2007":6.9,"nameRu":"ПАВЛОДАРСКАЯ ОБЛАСТЬ","measureKaz":"Пайыз","y2009":6.4,"measureRu":"Процент"},{"y2011":5.4,"y2010":5.8,"nameKaz":"Қазақстан Республикасы","y2002":9.3,"y2001":10.4,"y2004":8.4,"y2003":8.8,"y2006":7.8,"y2014":5,"y2005":8.1,"y2013":5.2,"y2008":6.6,"y2012":5.3,"y2007":7.3,"nameRu":"РЕСПУБЛИКА КАЗАХСТАН","measureKaz":"Пайыз","y2009":6.6,"measureRu":"Процент"},{"y2011":5,"y2010":5.4,"nameKaz":"Атырау облысы","y2002":10.7,"y2001":13.5,"y2004":9.3,"y2003":9.5,"y2006":8.4,"y2014":5,"y2005":9.1,"y2013":5,"y2008":6.3,"y2012":5,"y2007":7.4,"nameRu":"АТЫРАУСКАЯ ОБЛАСТЬ","measureKaz":"Пайыз","y2009":6.1,"measureRu":"Процент"},{"y2011":5.3,"y2010":5.6,"nameKaz":"Батыс Қазақстан облысы","y2002":10,"y2001":12.5,"y2004":9.2,"y2003":9.3,"y2006":8.6,"y2014":5,"y2005":9,"y2013":5.1,"y2008":7.1,"y2012":5.1,"y2007":7.8,"nameRu":"ЗАПАДНО-КАЗАХСТАНСКАЯ ОБЛАСТЬ","measureKaz":"Пайыз","y2009":6.3,"measureRu":"Процент"},{"y2011":5.6,"y2010":6.3,"nameKaz":"Алматы қ.","y2002":9.6,"y2001":10.8,"y2004":8.8,"y2003":8.9,"y2006":8.2,"y2014":5.5,"y2005":8.4,"y2013":5.6,"y2008":7.4,"y2012":5.6,"y2007":7.8,"nameRu":"Г.АЛМАТЫ","measureKaz":"Пайыз","y2009":7.7,"measureRu":"Процент"}]}';
?>